backend/app/controllers/application_controller.rb

    def current_user
      if decoded_token
        user_id = decoded_token['user_id']
        @user = User.find_by(id: user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]