backend/app/controllers/posts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
    def find_user
      @user = User.find_by(id: params[:user_id])